#+TITLE: January 2014 Work Report
#+AUTHOR: Joar Wandborg

* 2014-01-10
** Accounting API
   CLOCK: [2014-01-10 Fri 15:06]--[2014-01-10 Fri 15:23] =>  0:17
   CLOCK: [2014-01-10 Fri 15:05]--[2014-01-10 Fri 15:06] =>  0:01
   CLOCK: [2014-01-10 Fri 15:05]--[2014-01-10 Fri 15:05] =>  0:00
* 2014-01-16
** Accounting API
   CLOCK: [2014-01-17 Fri 00:00]--[2014-01-17 Fri 00:58] =>  0:58
   CLOCK: [2014-01-16 Thu 18:38]--[2014-01-16 Thu 22:34] =>  3:56
   CLOCK: [2014-01-16 Thu 17:01]--[2014-01-16 Thu 17:20] =>  0:19
*** Writing cython wrappers
    Ended up with a weird error, seems that including a file from
    ledger's include files carried over an unclosed {.
*** Migrating ledger to python 3
    Errors about missing symbols.
*** Writing an external 'extern "C" {}' file that includes ledger-files
    Same error as the cython wrappers.
*** Adding 'extern "C" {}' sections to ledger's source files
    CLOCK: [2014-01-17 Fri 00:58]--[2014-01-17 Fri 01:15] =>  0:17
* 2014-01-29
  CLOCK: [2014-01-29 Wed 19:37]--[2014-01-29 Wed 20:22] =>  0:45
* Summary

#+BEGIN: clocktable :maxlevel 2 :emphasize nil :scope file
#+CAPTION: Clock summary at [2014-02-04 Tue 20:41]
| Headline           |   Time |      |
|--------------------+--------+------|
| *Total time*       | *6:33* |      |
|--------------------+--------+------|
| 2014-01-10         |   0:18 |      |
| \__ Accounting API |        | 0:18 |
| 2014-01-16         |   5:30 |      |
| \__ Accounting API |        | 5:30 |
| 2014-01-29         |   0:45 |      |
#+END: clocktable
